       IDENTIFICATION DIVISION.
       PROGRAM-ID. main-program.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 WS-COUNTER UNSIGNED-INT.
           01 WS-NUM UNSIGNED-INT.
           01 WS-RESULT UNSIGNED-INT.
       PROCEDURE DIVISION.
           MOVE 0 TO WS-RESULT.
           PERFORM INCREMENT 3 TIMES.
           GOBACK.

       INCREMENT.
           MOVE WS-RESULT TO WS-NUM.
           CALL "increment" USING WS-NUM WS-RESULT.
           DISPLAY WS-RESULT.

