       IDENTIFICATION DIVISION.
       FUNCTION-ID. REPLACE-LETTER.
       DATA DIVISION.
           LINKAGE SECTION.
           01 LS-WORD PIC X(20).
           01 LS-HIDDEN-WORD PIC X(20).

       PROCEDURE DIVISION USING LS-WORD RETURNING LS-HIDDEN-WORD.

           INSPECT LS-WORD REPLACING ALL 'a' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'b' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'c' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'd' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'e' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'f' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'g' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'h' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'i' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'j' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'k' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'l' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'm' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'n' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'o' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'p' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'q' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'r' BY '*'.
           INSPECT LS-WORD REPLACING ALL 's' BY '*'.
           INSPECT LS-WORD REPLACING ALL 't' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'u' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'v' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'w' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'x' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'y' BY '*'.
           INSPECT LS-WORD REPLACING ALL 'z' BY '*'.

           MOVE LS-WORD TO LS-HIDDEN-WORD.

           END FUNCTION REPLACE-LETTER.
           